<?php
/*
    $result = $condition ? 'true result' : 'false result';
    HF কন্সাল্টেন্সি একটা ক্যালকুলেটর বানাতে চায় তাদের এজেন্ট এর ভর্তি ক্যাল্কুলেশন করার জন্যে,
    এখানে কন্ডিশন হলো-
    - যদি টিউশন ফি ২০০০০$ এর উপরে হয়,তাহলে ২৫% কমিশন পাবে,
    - যদি ১০০০০$ এর উপরে হয়, ২০% পাবে
    - যদি ১০০০০$ এর নিচে হয় & ৭০০০$ এর উপরে হয়, ১৫% পাবে,
    - ৭০০০$ এর নিচে হলে "ইনভ্যালিড"
    পিএইচপি টার্নারি অপারেটর ব্যাবহার এরকম ক্যালকুলেটর তৈরী করুন। */

$tution_fee = 21000; 
$Commission = ($tution_fee > 20000)? ($tution_fee * 0.25) : ($tution_fee > 10000 ?( $tution_fee* 0.20):
              ($tution_fee < 10000 && $tution_fee > 7000 ? ($tution_fee* 0.15) :'Invalid Data'));
echo $Commission;

?>